app/Http/Controllers/Resources/SuppliesController.php

select * from `supplies` where `supplies`.`deleted_at` is not null limit 5 offset 0
select count(*) as aggregate from `supplies` where `supplies`.`deleted_at` is not null
---
    public function index()
    {
        $supplies = $this->suppliesRepository->paginate($this->nbreParPage);
        if ( Input::get("filter") == "deleted" ){
            $supplies = $this->suppliesRepository->makeModel()->onlyTrashed()->paginate($this->nbreParPage);

update `supplies` set `confirmed_at` = '2020-04-21 21:44:00', `supplies`.`updated_at` = '2020-04-21 21:44:00' where `id` = 4
---
    public function confirm(int $id)
    {
        $supply = $this->suppliesRepository->find($id);
        $supply->update([
            "confirmed_at" => now()
        ]);